---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.PointFailures
source: html/b1b1f464-16e5-fd74-9350-a0e4b0397b9b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PointFailures

Failures about Point Element.

## Syntax (C#)
```csharp
public static class PointFailures
```